import React from "react";
import { makeStyles } from "@material-ui/core/styles";
import Typography from "@material-ui/core/Typography";
import Box from "@material-ui/core/Box";

const useStyles = makeStyles((theme) => ({
  mainContainer: {
    background: "#233",
  },
  timeLine: {
    position: "relative",
    padding: "1rem",
    margin: "o auto",
    "&:before": {
      content: "''",
      position: "absolute",
      height: "100%",
      border: "1px solid tan",
      right: "40px",
      top: 0,
    },
    "&:after": {
      content: "''",
      display: "table",
      clear: "both",
    },
    [theme.breakpoints.up("md")]: {
      padding: "2rem",
      "&:before": {
        left: "calc(50% - 1px)",
        right: "auto",
      },
    },
  },
  timeLineItem: {
    padding: "1rem",
    borderBottom: "2px solid tan",
    position: "relative",
    margin: "1rem 3rem 1rem 1rem",
    clear: "both",
    "&:after": {
      content: "''",
      position: "absolute",
    },
    "&:before": {
      content: "''",
      position: "absolute",
      right: "-0.625rem",
      top: "calc(50% - 5px)",
      borderStyle: "solid",
      borderColor: " #0c5c1f",
      borderWidth: "0.625rem",
      transform: "rotate(45deg)",
    },
    [theme.breakpoints.up("md")]: {
      width: "44%",
      margin: "1rem",
      "&:nth-of-type(2n)": {
        float: "right",
        margin: "1rem",
        borderColor: "tan",
      },
      "&:nth-of-type(2n):before": {
        right: "auto",
        left: "-0.625rem",
        borderColor: "#0c5c1f",
      },
    },
  },
  timeLineYear: {
    textAlign: "center",
    maxWidth: "9.375rem",
    margin: "0 3rem 0 auto",
    fontSize: "1.8rem",
    color: "#fff",
    background: "#0c5c1f",
    lineHeight: 1,
    padding: "0.5rem 1rem",
    "&:before": {
      display: "none",
    },
    [theme.breakpoints.up("md")]: {
      textAlign: "center",
      margin: "0 auto",
      "&:nth-of-type(2n)": {
        float: "none",
        margin: "0 auto",
      },
      "&:nth-of-type(2n):before": {
        display: "none",
      },
    },
  },
  heading: {
    color: "tan",
    padding: "3rem 0",
    textTransform: "uppercase",
  },
  subHeading: {
    color: "#fff",
    padding: 0,
    textTransform: "uppercase",
  },
  body1: {
    color: "#0c5c1f",
  },
  subtitle1: {
    color: "tan",
  },
}));

const Resume = () => {
  const classes = useStyles();
  return (
    <Box component="header" className={classes.mainContainer}>
      <Typography variant="h4" align="center" className={classes.heading}>
      วิธีแก้หนี้ที่ถูกต้องสำหรับลูกหนี้ที่มีหนี้สินเกินรายได้ต่อเดือนที่ได้รับไปมากจนเกินจะรับไหว
      </Typography>
      <Box component="div" className={classes.timeLine}>
        <Typography
          variant="h2"
          className={`${classes.timeLineYear} ${classes.timeLineItem}`}
        >
          1
        </Typography>
        <Box component="div" className={classes.timeLineItem}>
          <Typography
            variant="h5"
            align="center"
            className={classes.subHeading}
          >
            เข้าไปคุยกับธนาคาร
          </Typography>
          <Typography variant="body1" align="center" className={classes.body1}>
            
          </Typography>
          <Typography
            variant="subtitle1"
            align="center"
            className={classes.subtitle1}
          >
            สำหรับคนที่มีปัญหาให้เริ่มต้นที่โทรติดต่อและพูดคุยกับธนาคารโดยตรง เพราะทางตรงคือทางลัดที่ดีที่สุด บอกไปเลยว่าสถานะทางการเงินมีปัญหา มีทางไหนที่ธนาคารจะช่วยได้บ้าง อาจจะเป็นตั้งแต่ขอลดดอกเบี้ยชั่วคราว หรือขอจ่ายแค่ดอกเบี้ยชั่วคราว เพื่อให้เรามีสภาพคล่อง
            ขึ้นและตั้งหลักได้ หรือจนถึงการขอหยุดชำระชั่วคราว แล้วค่อยมาทำเรื่องผ่อนตามรายละเอียดกันไป
            วิธีข้างต้นอาจจะรู้สึกว่าทำให้เครดิตเสีย แต่ขอแนะนำว่าให้ลืมเรื่องเครดิตแล้วเอาชีวิตให้รอดก่อน หลายคนที่ทำตามวิธีนี้ มีบางธนาคารยอมเจรจา และช่วยเหลือผ่อนหนักให้เป็นเบาขึ้น ถ้าเริ่มเบาลงเราก็จะสบายใจและคล่องขึ้น ตัวอย่างเช่น เราค้างค่าบัตรเครดิต 50,000 บาท ธนาคารเก็บขั้นต่ำ 10% คือ 5,000 บาท ถ้าเราไม่ไหว อาจจะขอจ่ายเดือนละ 1,500 บาท เครดิตเราอาจพังไปช่วงหนึ่ง แต่ถ้าหนี้ต่อเดือนเกิน 1 ใน 3 ของรายได้ โอกาสที่รอดจากการเสียเครดิต หรือไม่ใช้ยาแรงมันจะรอดยากมาก เราต้องมีเงินก้อนใหญ่มาปิดหนี้เท่านั้น ฉะนั้นเมื่อเราเห็นว่าปลายทางมันพังแน่ เราชิงพังก่อน ดีกว่าไม่ยอมพังแล้วไปกู้มาผ่อน อย่างนี้เงินต้นไม่ได้ลด แค่ทำให้แต่ละเดือนมันรอดแบบขายผ้าเอาหน้ารอด แต่มันไม่ทำให้จบ
            การเข้าไปคุยกับธนาคารจะทำให้เราเริ่มจัดสรรตัวเองได้ง่ายขึ้น เรามีหน้าที่เจรจา ธนาคารเองก็มีสิทธิ์ที่จะให้หรือไม่ให้ แต่การได้เริ่มเจรจาถือเป็นการสร้างโอกาส ดีกว่าไม่พูดอะไรเลย อยากฝากไปถึงธนาคารว่า ถ้ามีลูกค้าเจรจากับธนาคารแบบนี้ ส่วนใหญ่เป็นหนี้เสียของธนาคาร ซึ่งธนาคารจะมีตัวเลข KPI ชี้วัด แต่ถ้าธนาคาร
            ใจดีรับเจรจาและช่วยกันแก้ปัญหา หนี้เสียเหล่านี้ก็จะไม่ลุกลามใหญ่โต

          </Typography>
        </Box>
        <Typography
          variant="h2"
          className={`${classes.timeLineYear} ${classes.timeLineItem}`}
        >
          2
        </Typography>
        <Box component="div" className={classes.timeLineItem}>
          <Typography
            variant="h5"
            align="center"
            className={classes.subHeading}
          >
           ดูว่าหนี้สินตัวไหนที่สามารถตัดจ่ายตัดขายได้บ้าง
          </Typography>
          <Typography variant="body1" align="center" className={classes.body1}>
            
          </Typography>
          <Typography
            variant="subtitle1"
            align="center"
            className={classes.subtitle1}
          >
              ข้อนี้อาจจะทำหลังจากธนาคารไม่ยอมเจรจาด้วย ซึ่งสิ่งที่สามารถตัดขายได้หลักๆ คือ บ้านและรถ เมื่อตัดขายสองอย่างนี้พลังในการแก้หนี้ไม่เท่ากัน แต่ที่แน่ๆ จะสะเทือนความรู้สึกมาก เพราะเราจะรู้สึกว่าเป็นทรัพย์สินของชีวิต การมีบ้านมีรถเป็นของตัวเองจะทำให้รู้สึกดีและภาคภูมิใจ แต่เมื่อชีวิตลงมาถึงจุดที่ต้องตัดใจขายอย่างใดอย่างหนึ่ง เราจะรู้สึกไม่มั่นคงเป็นธรรมดา แต่อยากให้มองว่า ถ้าวันนี้เราเป็นหนี้รถ ประมาณ 500,000 บาท หนี้บ้าน 2,000,000 บาท การที่เราตัดขายทันที หนี้ 2,500,000 บาท จะหายไปจากพอร์ตหนี้ของเรา มันจะทำให้สภาพคล่องเรากลับมา
 
เรามีบ้านเพื่ออยู่อาศัย อาจไม่ต้องซื้อเป็นของตัวเองเสมอไป ในวันที่เราไม่ไหว เราต้องยอมขายมันไปก่อน แล้วไปหาเช่าอยู่ก็ไม่ใช่เรื่องเสียหาย

          </Typography>
          <Typography
            variant="h5"
            align="center"
            className={classes.subHeading}
          >
          “ในช่วงชีวิตที่กำลังจมลงเรื่อยๆ ถ้าเรายังไปกอดของหนักอยู่ มันก็จะยิ่งทำให้ตัวเราจมลงไปเรื่อยๆ แต่หากเมื่อไรที่เราปล่อยไปบ้าง เราก็มีโอกาสลอยขึ้นมาบนน้ำได้”
          </Typography>
          <Typography
            variant="subtitle1"
            align="center"
            className={classes.subtitle1}
          >
            และการขายบ้านไปไม่ได้หมายความว่าเราจะซื้อกลับมาไม่ได้ วันหนึ่งเราอาจมีบ้านที่ใหญ่และสวยงามกว่าเดิมก็ได้ โค้ชเองก็เคยผ่านประสบการณ์นี้ ตอนนั้นธนาคารแนะนำให้ขายบ้านทิ้ง เพราะส่งมาเกือบ 8 ปีแล้ว เงินต้นลดลงไปพอสมควร แถมทุกวันนี้บ้านที่เคยซื้อมาราคาก็สูงขึ้น เพราะรอบบ้านเจริญเติบโตหมด โค้ชตัดสินใจกันอยู่นานว่าจะขายแล้วเอาเงินส่วนต่างมาใช้หนี้ดีไหม จนสุดท้ายต้องมาตั้งคำถามกันว่า บ้านคืออะไร จนแม่ของโค้ชพูดขึ้นมาว่า “บ้านคือที่ที่เราอยู่พร้อมหน้าพร้อมตากันทั้งครอบครัว” เพราะฉะนั้นมันอาจจะไม่ใช่บ้านหลังนี้ ไม่ใช่หลังที่เรากู้ซื้อ แต่อาจเป็นหลังที่เช่าอยู่ก็ได้ แต่ทุกคนอยู่กันพร้อมหน้า นั่นต่างหากที่เป็นบ้านของเรา พอคิดได้อย่างนี้ทุกอย่างก็จบ เพราะแค่พ่อ แม่ ลูก อยู่ด้วยกัน ไม่ว่าอยู่ที่ไหนก็คือบ้าน สุดท้ายก็ตัดสินใจขายบ้านมาเคลียร์หนี้
              ส่วนรถจะต่างจากบ้านตรงที่มูลค่าจะลดลงเรื่อยๆ ไม่เหมือนบ้านที่ขายแล้วจะมีส่วนต่างที่ทั้งปลดหนี้ตัวบ้านและส่วนต่างที่ปลดหนี้อื่นๆ ได้ แต่การขายรถจะปลดเปลื้องได้แค่หนี้รถที่ไม่ต้องผ่อน วิธีมองก็คล้ายกันคือ ใจความของรถคือพาหนะในการเดินทาง เราขายมัน
              ไปช่วงเดียว สุดท้ายเราก็กลับมาใช้ขนส่งสาธารณะ รถเมล์ รถไฟฟ้า แท็กซี่ แต่เทียบกันแล้วระหว่างบ้านกับรถ หลายคนอาจจะรู้สึกว่าขายบ้านยากกว่า เพราะเป็นของใหญ่ แต่ที่โค้ชพบคือรถขายยากกว่า เพราะหลายคนไม่ได้คิดว่ามันเป็นแค่ยานพาหนะ แต่เป็นหน้าเป็นตา เวลาขายจึงตัดใจขายกันลำบากพอสมควร และด้วยมูลค่าของรถที่เวลาผ่านไปยิ่งตกลง หลายคนเลยไม่อยากขาย
              หลายครั้งที่โค้ชพบว่า คนปลดหนี้ด้วยการขายบ้านหรือขายรถออกไป จะช่วยให้ปลดหนี้ได้เร็วขึ้นจริง โดยเฉพาะบ้าน อยากให้ทุกคนลองตัดสินใจดู

          </Typography>
        </Box>
        <Typography
          variant="h2"
          className={`${classes.timeLineYear} ${classes.timeLineItem}`}
        >
          3
        </Typography>
        <Box component="div" className={classes.timeLineItem}>
          <Typography
            variant="h5"
            align="center"
            className={classes.subHeading}
          >
            หยุดชำระ (ชั่วคราว)
          </Typography>
          <Typography variant="body1" align="center" className={classes.body1}>
          
          </Typography>
          <Typography
            variant="subtitle1"
            align="center"
            className={classes.subtitle1}
          >
              ถ้าเป็นหนี้ในระบบ หากหยุดชำระจะมีกระบวนการชัดเจน แต่ถ้าเป็นหนี้นอกระบบ จะมีกระบวนการวุ่นวาย เพราะคนปล่อยหนี้นอกระบบมีอยู่หลักๆ 2 กลุ่มคือ กลุ่มเพื่อนสนิท และผู้มีอิทธิพล สำหรับกลุ่มแรกเราอาจเสียเพื่อน ส่วนกลุ่มหลังเราอาจเดือดร้อนจากผู้มีอิทธิพล โค้ชจึงเตือนเสมอว่าอย่าเป็นหนี้นอกระบบเด็ดขาด เพราะอันตราย การเป็นหนี้ในระบบถึงล้มก็จะล้มเป็นขั้นเป็นตอนกว่า
              การหยุดชำระในระบบ ถ้าธนาคารไม่ยอมเจรจาช่วยเหลือลูกหนี้ตั้งแต่ต้น จุดนี้จะมาถึงแน่นอนไม่วันใดก็วันหนึ่ง เพราะคนเป็นหนี้อาการหนักจะไม่ได้เป็นหนี้ที่ใดที่เดียว แต่ส่วนใหญ่จะเปิดบัตรวนไปเรื่อยๆ และถามตัวเองว่าที่ไหนยังเปิดบัตรและสร้างเครดิตได้ หนี้จะพอกไปเรื่อยๆ รายรับของเขาจะห่างจากรายจ่ายเยอะมาก และจะไปถึงจุดที่หยุดชำระอยู่ดี
              ในมุมของเราพอหยุดจ่าย จะไม่มีภาระที่ต้องจ่ายเป็นรายเดือน แต่ต้องเน้นว่า หยุดจ่ายตรงนี้เป็นการหยุดชั่วคราว ไม่ว่าอย่างไร เราเป็นหนี้เขา เราต้องคืนเงินเขาทุกบาททุกสตางค์ การหยุดจ่ายชั่วคราวคือการหยุดเพื่อมองตัวเอง เรามีรายรับเท่าไร ค่ากินอยู่ใช้จ่ายที่จำเป็นเท่าไร เราจะมีเงินเหลือก้อนหนึ่งที่ไม่พอใช้หนี้ทุกรายการ เราเลยต้องหยุดชำระเพื่อเก็บเงินก้อนนี้ แล้วรอคอยการเจรจา เรายังต้องหาทางเจรจากับธนาคารตลอดเวลา เช่น เคสหนึ่งมีเงินเดือน 45,000 บาท หักค่าใช้จ่ายรวมหนี้ติดลบ 20,000 บาท โค้ชแนะนำให้หยุดและจัดการเงินของตัวเอง พบว่าพอหยุดจ่ายมีเงินเหลือ 15,000 บาท สิ่งที่ควรทำคือเก็บ 15,000 บาทนั้นทุกเดือน หากธนาคารโทรมาก็ยอมรับความจริงไปว่าสถานการณ์ทางการเงินไม่ดี และบอกว่ามีความตั้งใจจะจ่าย สามารถจ่ายได้เดือนละเท่านี้บาท ธนาคารยอมรับได้ไหม ถ้าธนาคารไม่ตกลงก็ไม่เป็นไร เราเก็บเงินต่อไป สุดท้ายจะไปจบกันที่ศาล วันนั้น
              เราก็สามารถเจรจาได้อีก แต่ส่วนใหญ่ทุกวันนี้ธนาคารจะไม่ให้ไปถึงจุดนั้น แต่จะติดต่อมาหาเราก่อน
 
คำถามคือถ้าเราหยุดจ่ายหนี้ แต่เรายังกินอยู่ใช้จ่ายแบบปกติ สุดท้ายพอถึงกระบวนการศาลที่ใช้เวลา 6 เดือนถึง 1 ปี แล้วเราไม่มีเงินไปจ่ายเขาเลยก็ไม่โอเค แต่ถ้าเราหยุดแล้วมีเงินเก็บมากขึ้น พอถึงวันหนึ่งเราจะมีเงินเพื่อไปชำระหนี้มากขึ้น พอเจ้าหนี้ติดต่อมาก็ลองเจรจาดูว่าต้องจ่ายเท่าไร ขอลดได้ไหม โดยดูกำลังของเราด้วย
 
คนที่เป็นหนี้หนักๆ โค้ชแนะนำว่า เราต้องมีเงินสดเผื่อบริหารจัดการในการใช้คืนเสมอ บางคนมีเงินติดตัว 2,000-3,000 บาทก็ให้เขาหมด เราก็ไม่เหลือกินเหลือใช้ เริ่มเป็นทุกข์ เป็นกังวล เราควรถือเงินติดตัวไว้บ้าง และควรจัดสรรขอลดหนี้เท่าที่เราทำได้ ค่อยๆ ทำแบบนี้ไป แต่ถ้าคิดว่าการเก็บเงินช้าเกินไป ก็ถึงเวลาที่เราต้องหารายได้เพิ่ม ไม่อย่างนั้นแล้วเงินมันก็ไม่พอจ่ายหนี้
 
ระหว่างนั้นถ้าเราถูกทวงหนี้บ้างเป็นเรื่องปกติ เราต้องตั้งสติในการรับมือ ถ้าเขาโทรมาเราก็รับโทรศัพท์และบอกไปตามความจริง อาจถามถึงช่องทางในการช่วยเหลืออย่างตรงไปตรงมา อาจขอลดดอกเบี้ยหรือลดหนี้ให้ทั้งก้อนแล้วทยอยจ่าย การเจรจาถ้าเราไม่พูดหรือมีข้อเสนออะไรที่เป็นประโยชน์กับตัวเราบ้างมันก็ไม่เกิด เพราะเรารู้เงื่อนไขของตัวเอง เราต้องเจรจาว่าเราไหวที่เท่าไร
          </Typography>
        </Box>
        
        
          
        
      </Box>
    </Box>
  );
};

export default Resume;
